/*
 * app.hpp
 *
 *  Created on: 2016/06/28
 *      Author: 元太
 */

#ifndef APP_HPP_
#define APP_HPP_

/****************************************
 Wait関数
 ****************************************/
void waitTime(int16_t wait_ms);
/****************************************
 バッテリーチェック
 ****************************************/
float checkBatt(void);
/****************************************
 スイッチ
 ****************************************/
int16_t pushButton(void);
int16_t waitButton(void);
/****************************************
 センサー値返す
 ****************************************/
int16_t returnSenVal(uint8_t mode);
/****************************************
 モード選択LED
 ****************************************/
int16_t driveLED(int16_t mode);
/****************************************
 フルカラーLED
 ****************************************/
int16_t driveRGB(int16_t RED, int16_t GREEN, int16_t BLUE, int8_t on_off);

/****************************************
 モード選択
 ****************************************/
uint16_t selectMode(int16_t max_mode);
/****************************************
deg-rad変換
****************************************/
float convDegRad(float degree) ;


#endif /* APP_HPP_ */
