/*
 * map.h
 *
 *  Created on: 2016/10/06
 *      Author: Gen
 */

#ifndef MAP_H_
#define MAP_H_

/****************************************
 方位管理
 ****************************************/
void checkOrient(int ori_deg);
/****************************************
 方位セット
 ****************************************/
void setOrient(uint8_t orient);
/****************************************
 座標管理
 ****************************************/
void countCoord(void);
void countCoord2(int8_t *x, int8_t *y);
/****************************************
現在座標セット
 ****************************************/
void setCurrentCoord(uint16_t x,uint16_t y);
/****************************************
ゴール座標セット
 ****************************************/
void setTargetCoord(uint16_t x,uint16_t y);
/****************************************
 map表示
 ****************************************/
void printMap(void);
void printMapNew(void);
/****************************************
 初期壁セット
 ****************************************/
void setInitWall(void);
/****************************************
 壁情報セット
 ****************************************/
void setWallData(wall_t *wall_info,uint16_t x, uint16_t y, uint8_t orient, uint16_t wall);
void setWallDataKnown(wall_t *wall_info,uint16_t x, uint16_t y);
/****************************************
 壁情報ゲット
 ****************************************/
uint8_t getWallData(wall_t *wall_info,uint16_t x, uint16_t y, uint8_t orient);
uint8_t getWallDataKnown(wall_t *wall_info,uint16_t x, uint16_t y, uint8_t orient);

/****************************************
 壁情報決定版
 ****************************************/
void matchWallGoal(void) ;
/****************************************
 壁情報読み込み
 ****************************************/
void checkWall(void);
/****************************************
 壁有無判定
 ****************************************/
uint8_t isNoWall(wall_t *wall_info,uint8_t dir);
uint8_t isNoWall2(wall_t *wall_info, uint8_t x, uint8_t y, uint8_t dir);
/****************************************
 壁既知データ有無判定
 ****************************************/
uint8_t isUnknownWall(wall_t *wall_info,uint8_t dir) ;
/****************************************
 進行方向の歩数確認
 ****************************************/
uint8_t isSmallerSteps(uint8_t dir);
uint8_t isSmallerSteps2(uint8_t coord_x, uint8_t coord_y, uint8_t dir);
/****************************************
 進行方向が既知か未知か
 ****************************************/
uint8_t isUnknownSection(uint16_t x, uint16_t y);
uint8_t isUnknownSection2(uint16_t x, uint16_t y);
uint8_t isUnknownNextSection(uint8_t dir);
/****************************************
 queuemap
 ****************************************/
void countStepQueue(void);
void countStepQueueNew(void);
/****************************************
 足立法
 ****************************************/
void searchAdachi(void);
/****************************************
 古川法
 ****************************************/
void searchFurukawa(void);
/****************************************
 櫛潰し
 ****************************************/
void breakComb(void);
/****************************************
 最短
 ****************************************/
void countStepShortest(void);

/****************************************
 path生成(小回り)
 ****************************************/
void makePath(void);
/****************************************
 path生成2
 ****************************************/
void makePath2(void);
/****************************************
 path生成3
 ****************************************/
void makePath3(void);
/****************************************
 path表示
 ****************************************/
void printPath(void);
/****************************************
 path表示2
 ****************************************/
void printPath2(void);
/****************************************
 path表示3
 ****************************************/
void printPath3(void);
/****************************************
 path表示test
 ****************************************/
void printPathTest(void);
/****************************************
 path表示test斜め
 ****************************************/
void printPathTestDiagonal(void);
/****************************************
 path走行
 ****************************************/
void runPath(void) ;
/****************************************
 斜めpath走行1
 ****************************************/
void runPathDiagonal(uint8_t t_velo,float velo,float acc,float d_velo,float d_acc) ;

/****************************************
 スピードコネクト
 ****************************************/
float connectSpeedEnd(int esc);
float connectSpeed1000(int esc);
float connectSpeed1200(int esc);

/****************************************
 path走行　初期距離追加
 ****************************************/
float addInitDis(uint16_t count);
/****************************************
最短ゴール処理
 ****************************************/
void processShotestGoal(void);
/****************************************
 サーキット
 ****************************************/
void selectModeCircuit(void);


#endif /* MAP_H_ */
